# pandas

In [14]:
import pandas as pd
List1=[2,4,5,6,7,8999,888,8867567567]

df=pd.Series(List1)
df

0             2
1             4
2             5
3             6
4             7
5          8999
6           888
7    8867567567
dtype: int64

In [6]:
list1 = [[2, 'AAA', 22],
         [1, 'BBB', 25],
         [1, 'CCC', 24]]
df=pd.DataFrame(list1,columns=["A","B","C"])
df

   A    B   C
0  2  AAA  22
1  1  BBB  25
2  1  CCC  24

In [15]:
shopsy={
    'Item':["causals","frocks","tshirts","chudidhars","westrenwear","formals","ethinic wear","jackets","shervaani","kurtas"],
    'In stock':[55,34,55,78,87,55,22,33,11,77],
    'gender':["kids","girls","men","women","boys","men","kids","men","ladies","boys"],
    'startingprice':[4000,10000,500,20000,8000,23333,6999,2222,77777,88888]
}
df=pd.DataFrame(shopsy)
df

           Item  In stock  gender  startingprice
0       causals        55    kids           4000
1        frocks        34   girls          10000
2       tshirts        55     men            500
3    chudidhars        78   women          20000
4   westrenwear        87    boys           8000
5       formals        55     men          23333
6  ethinic wear        22    kids           6999
7       jackets        33     men           2222
8     shervaani        11  ladies          77777
9        kurtas        77    boys          88888

In [16]:
df.describe()

        In stock  startingprice
count  10.000000      10.000000
mean   50.700000   24171.900000
std    25.390506   32121.527829
min    11.000000     500.000000
25%    33.250000    4749.750000
50%    55.000000    9000.000000
75%    71.500000   22499.750000
max    87.000000   88888.000000

In [22]:
df.shape

(10, 4)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Item           10 non-null     object
 1   In stock       10 non-null     int64
 2   gender         10 non-null     object
 3   startingprice  10 non-null     int64
dtypes: int64(2), object(2)
memory usage: 452.0+ bytes

In [19]:
df.head()

      Item  In stock gender  startingprice
0  causals        55   kids           4000
1   frocks        34  girls          10000

In [20]:
df.tail(4)

           Item  In stock  gender  startingprice
6  ethinic wear        22    kids           6999
7       jackets        33     men           2222
8     shervaani        11  ladies          77777
9        kurtas        77    boys          88888

In [29]:
df[["Item","gender"]]

           Item  gender
0       causals    kids
1        frocks   girls
2       tshirts     men
3    chudidhars   women
4   westrenwear    boys
5       formals     men
6  ethinic wear    kids
7       jackets     men
8     shervaani  ladies
9        kurtas    boys

# Case Studies

In [ ]:
import pandas as pd
import numpy as nm

In [96]:
inp0=pd.read_csv(r'C:\Users\sairam\Desktop\m@noj\07novpythonwork.csv')

In [97]:
inp0

        Name    Company         Occupaton  Salary   Id
0  Sai manoj        HCL   Trainee analyst   30000   78
1   Vyshnavi        CGI         Developer   20000   65
2     Venkat        TCS      Data analyst   25000   99
3    Sandhya  ACCENTURE  Customer Service   38000  152
4   Maneesha        CGI         Developer   25000  500

In [98]:
inp0=pd.read_csv(r'C:\Users\sairam\Desktop\m@noj\07novpythonworknullified.csv')

In [99]:
inp0

        Name Company         Occupaton   Salary     Id
0  Sai manoj     HCL               NaN  30000.0   78.0
1   Vyshnavi     NaN         Developer      NaN    NaN
2     Venkat     TCS               NaN      NaN    NaN
3    Sandhya     NaN  Customer Service  38000.0  152.0
4   Maneesha     CGI         Developer      NaN    NaN

In [109]:
inp1=pd.read_csv(r'C:\Users\sairam\Desktop\m@noj\07novpythonworknullified.csv')

In [110]:
inp1

        Name Company         Occupaton   Salary     Id
0  Sai manoj     HCL               NaN  30000.0   78.0
1   Vyshnavi     NaN         Developer      NaN    NaN
2     Venkat     TCS               NaN      NaN    NaN
3    Sandhya     NaN  Customer Service  38000.0  152.0
4   Maneesha     CGI         Developer      NaN    NaN

In [111]:
inp1.isnull().sum().sort_values(ascending=False)

Salary       3
Id           3
Company      2
Occupaton    2
Name         0
dtype: int64

In [113]:
inp1.Salary.isnull().sum()

3

In [122]:
inp1['Salary'].mean()

34000.0

In [125]:
inp1['Salary']=inp1['Salary'].fillna(inp1['Salary']).mean()

In [129]:
inp1.isnull().sum().sort_values(ascending=False)

Id           3
Company      2
Occupaton    2
Name         0
Salary       0
dtype: int64

In [133]:
inp1['Id'].isnull().mode()[0]

True

In [134]:
inp1['Id']=inp1['Id'].fillna(inp1['Id']).mode()[0]

In [135]:
inp1.isnull().sum()

Name         0
Company      2
Occupaton    2
Salary       0
Id           0
dtype: int64

In [138]:
inp1['Company'].isnull().mode()[0]

False

In [139]:
inp1['Company']=inp1['Company'].fillna(inp1['Company']).mode()[0]

In [140]:
inp1.isnull().sum()

Name         0
Company      0
Occupaton    2
Salary       0
Id           0
dtype: int64

In [143]:
inp1['Occupaton'].isnull().sum()

2

In [146]:
inp1['Occupaton'].isnull().mode()[0]

False

In [148]:
inp1=inp1[~inp1.Occupaton.isnull()]

In [150]:
inp1.isnull().sum().sort_values()

Name         0
Company      0
Occupaton    0
Salary       0
Id           0
dtype: int64

In [ ]:
df=pd.read_csv(r'C:\Users\sairam\Downloads\googleplaystore_v2.csv')

In [31]:
df.head(5)

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
0,Photo Editor & Candy Camera & Grid & ScrapBook,ART_AND_DESIGN,4.1,159,19000.0,"10,000+",Free,0,Everyone,Art & Design,"January 7, 2018",1.0.0,4.0.3 and up
1,Coloring book moana,ART_AND_DESIGN,3.9,967,14000.0,"500,000+",Free,0,Everyone,Art & Design;Pretend Play,"January 15, 2018",2.0.0,4.0.3 and up
2,"U Launcher Lite – FREE Live Cool Themes, Hide ...",ART_AND_DESIGN,4.7,87510,8700.0,"5,000,000+",Free,0,Everyone,Art & Design,"August 1, 2018",1.2.4,4.0.3 and up
3,Sketch - Draw & Paint,ART_AND_DESIGN,4.5,215644,25000.0,"50,000,000+",Free,0,Teen,Art & Design,"June 8, 2018",Varies with device,4.2 and up
4,Pixel Draw - Number Art Coloring Book,ART_AND_DESIGN,4.3,967,2800.0,"100,000+",Free,0,Everyone,Art & Design;Creativity,"June 20, 2018",1.1,4.4 and up

In [33]:
df.isnull().sum()

App                  0
Category             0
Rating            1474
Reviews              0
Size                 0
Installs             0
Type                 1
Price                0
Content Rating       1
Genres               0
Last Updated         0
Current Ver          8
Android Ver          3
dtype: int64

In [39]:
df.Rating.isnull().sum()

1474

In [40]:
df=df[~df.Rating.isnull()]

In [41]:
df.Rating.isnull().sum()

0

In [47]:
df.isnull().sum().sort_values(ascending=False)

Current Ver       4
Android Ver       3
Content Rating    1
App               0
Category          0
Rating            0
Reviews           0
Size              0
Installs          0
Type              0
Price             0
Genres            0
Last Updated      0
dtype: int64

In [48]:
df['Current Ver'].isnull().value_counts()

Current Ver
False    9363
True        4
Name: count, dtype: int64

In [50]:
df['Current Ver'].mode([0])

0    Varies with device
Name: Current Ver, dtype: object

In [51]:
df['Current Ver']=df['Current Ver'].fillna(df['Current Ver']).mode()[0]

In [54]:
df.isnull().sum().sort_values(ascending=False)

Android Ver       3
Content Rating    1
App               0
Category          0
Rating            0
Reviews           0
Size              0
Installs          0
Type              0
Price             0
Genres            0
Last Updated      0
Current Ver       0
dtype: int64

In [57]:
df['Android Ver'].isnull().value_counts()

Android Ver
False    9364
True        3
Name: count, dtype: int64

In [61]:
df['Android Ver'].isnull().mode()[0]

False

In [62]:
df['Android Ver']=df['Android Ver'].fillna(df['Android Ver']).mode()[0]

In [65]:
df['Android Ver'].isnull().sum()

0

In [66]:
df.isnull().sum()

App               0
Category          0
Rating            0
Reviews           0
Size              0
Installs          0
Type              0
Price             0
Content Rating    1
Genres            0
Last Updated      0
Current Ver       0
Android Ver       0
dtype: int64

In [68]:
df['Content Rating'].isnull().sum()

1

In [90]:
df['Content Rating'].isnull().mode()[0]

False

In [94]:
df['Content Rating']=df['Content Rating'].fillna(df['Content Rating']).mode()[0]

In [95]:
df.isnull().sum()

App               0
Category          0
Rating            0
Reviews           0
Size              0
Installs          0
Type              0
Price             0
Content Rating    0
Genres            0
Last Updated      0
Current Ver       0
Android Ver       0
dtype: int64

In [151]:
df['Content Rating'] = df['Content Rating'].fillna(df['Content Rating'].mode()[0])

In [152]:
df.isnull().sum()

App               0
Category          0
Rating            0
Reviews           0
Size              0
Installs          0
Type              0
Price             0
Content Rating    0
Genres            0
Last Updated      0
Current Ver       0
Android Ver       0
dtype: int64

In [162]:
df.Price.value_counts()

Price
0.00      8719
2.99       114
0.99       107
4.99        70
1.99        59
          ...
1.29         1
299.99       1
379.99       1
37.99        1
1.20         1
Name: count, Length: 73, dtype: int64

In [153]:
df = df[df['Price'] != 'Everyone']

In [159]:
df['Price']=df['Price'].apply(lambda x:0 if x=='0' else float(x[1:]))

C:\Users\sairam\AppData\Local\Temp\ipykernel_10488\2118472889.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Price']=df['Price'].apply(lambda x:0 if x=='0' else float(x[1:]))

In [161]:
df['Price'].value_counts()

Price
0.00      8719
2.99       114
0.99       107
4.99        70
1.99        59
          ...
1.29         1
299.99       1
379.99       1
37.99        1
1.20         1
Name: count, Length: 73, dtype: int64

In [163]:
x = '50,000,000+'
x[:-1]

'50,000,000'

In [200]:
def my_fun():
    x = '50,000,000+'
    
    x.replace('+','').replace(',','')
    print(x,end="")
my_fun()

50,000,000+

In [202]:
def clean_vals(value):
    return int(value.replace('+','').replace(',',''))

In [203]:
df['Installs'] = df['Installs'].apply(clean_vals)

C:\Users\sairam\AppData\Local\Temp\ipykernel_10488\4098813880.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Installs'] = df['Installs'].apply(clean_vals)

In [204]:
df['Installs']

0           10000
1          500000
2         5000000
3        50000000
4          100000
           ...
10834         500
10836        5000
10837         100
10839        1000
10840    10000000
Name: Installs, Length: 9366, dtype: int64

In [205]:
df.Reviews

0           159
1           967
2         87510
3        215644
4           967
          ...
10834         7
10836        38
10837         4
10839       114
10840    398307
Name: Reviews, Length: 9366, dtype: object

In [208]:
df.Reviews = df.Reviews.astype('int64')

C:\Users\sairam\AppData\Local\Temp\ipykernel_10488\3109170862.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.Reviews = df.Reviews.astype('int64')

In [209]:
df[df.Reviews > df.Installs].shape

(7, 13)

In [210]:
df=df[df.Reviews > df.Installs].shape